import Switch from "../component/Switch";

function HeadPage() {
  let places = [
    {
      id: "Taif",
      name: "مدينة الطائف 🌸",
      image: "https://also3odyah.com/wp-content/uploads/2023/12/taif.jpg",
      description:
        'تتُعرف الطائف بـ"عروس المصايف" و"مدينة الورود"، حيث تزدهر الورود العطرة في الوديان والجبال المحيطة. تقع المدينة على ارتفاع يوفر مناخاً بارداً مثالياً للهروب من حر الصيف. يمكن زيارة بساتين الورود في أبريل والاستمتاع بمهرجان سوق عكاظ ومهرجان ولي العهد للهجن في أغسطس.',
    },
    {
      id: "Abha",
      name: "مدينة أبها 🌫️",
      image:
        "https://alsyahaalarabia.com/wp-content/uploads/2023/09/184138.jpg",
      description:
        "مدينة أبها تتميز بمناخ معتدل، وهي مرتفعة أيضًا بمعدل كبير عن مستوى سطح البحر، ونظرًا إلى هذه الطبيعة المناخية والأرضية المناسبة للزراعة التي تتمتع بها أبها؛ فهناك تنوع كبير في المحاصيل الزراعية مثل الذرة الرفيعة والذرة الشامية والرمان والعنب والتفاح والمشمش والليمون والفراولة والخوخ والتين والبرشومي.",
    },
    {
      id: "Hail",
      name: "مدينة حائل ⛰️",
      image:
        "https://saudipedia.com/saudipedia/uploads/images/2023/12/14/83048.jpg",
      description:
        "تتميز حائل بموقعها الاستراتيجي على أطراف صحراء النفود بتضاريسها المتنوعة. عندما تزور حائل لا تفوت التنزه بين جبالها، وسهولها، وأوديتها، وكثبانها الرملية البديعة. خيّم هناك واستكشف الفن الصخري في المنطقة التي أصبحت الآن أحد مواقع التراث العالمي لليونسكو.",
    },
    {
      id: "Tabuk",
      name: "مدينة تبوك 🗻🪸",
      image:
        "https://portalcdn.spa.gov.sa/backend/original/202401/HuElR3R2sGVM8sSbAAtI0WXNC91Xb7IMjRbjWkgS.jpg",
      description:
        ' مدينة المستقبل "نيوم"، وهي نموذج لحياة البشرية المستقبلية القائمة على الاستدامة',
    },
    {
      id: "Al-ula",
      name: "مدينة العلا🏜️",
      image:
        "https://details.sa/ar/wp-content/uploads/2024/03/%D9%82%D9%85%D8%A9-%D8%A7%D9%84%D8%B9%D9%84%D8%A72024.jpeg",
      description:
        "توفر الحياة في العلا مزيجًا فريدًا بين الإرث التاريخي والبيئة الطبيعية، حيث يستمتع الأهالي والسكان بنمط حياة هادئ مع توفر وسائل الراحة الحديثة، والفعاليات الثقافية، والمغامرات في الهواء الطلق، في مجتمع يُقدّر التراث والاستدامة.",
    },
    {
      id: "Riyadh",
      name: "🇸🇦مدينة الرياض",
      image:
        "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Riyadh_Skyline.jpg/1200px-Riyadh_Skyline.jpg",
      description:
        "الرِّيَاض هي عاصمة المملكة العربية السعودية،  وأكبر مدنها وثالث أكبر عاصمة عربية من حيث عدد السكان. تقع الرياض وسط شبه الجزيرة العربية في هضبة نجد، على ارتفاع 600 متر فوق مستوى سطح البحر. وهي مقر إمارة منطقة الرياض حسب التقسيم الإداري للمناطق السعودية. يسكن مدينة الرياض 7.009.120 مليون نسمة وفق إحصائيات تعداد السعودية 2022. وتعتبر العاصمة السعودية إحدى أسرع مدن العالم توسعًا،  فخلال نصف قرن من نشأتها اتسعت مساحة المدينة الصغيرة إلى 1800 كيلو متر مربع، حتى بلغت 3.115 كم2. في الوقت الحاضر.",
    },
    {
      id: "Jeddah",
      name: "مدينة جدة 🌊",
      image:
        "https://www.agoda.com/wp-content/uploads/2024/06/jeddah-saudi-arabia.jpg",
      description:
        "مدينة جدة عروس البحر الأحمر، وأكبر المدن المطلة عليه، تمتاز بموقعها الجغرافي لكونها البوابة المؤدية إلى أقدس الأماكن في العالم، فهي أول محطة يحط فيها الحجاج القادمون من جميع أنحاء العالم في طريقهم إلى مكة المكرمة، عن طريق مطارها الدولي، ومينائها البحري، كما تمتاز جدة بشواطئها الجميلة.",
    },
    {
      id: "Makkah",
      name: "مكة المكرمة 🕋",
      image:
        "https://travilia.com/uploads/0000/8/2024/09/26/hajj-rituals-makkah-accorhotels.jpg",
      description:
        "مهبط الوحي ومنطلق رسالة الإسلام السمحاء لمكة المكرمة مكانة خاص في قلوب المسلمين، فهي مهبط الوحي على خاتم الأنبياء محمد - صلى الله عليه وسلم -، وفيها نزل القرآن الكريم، ومنها انطلقت رسالة الإسلام السمحاء إلى مختلف أصقاع الأرض، مهوى أفئدة المسلمين وقبلتهم.",
    },
    {
      id: "Madinah",
      name: "المدينة المنورة 🕌",
      image:
        "https://news.files.bbci.co.uk/include/extra/shorthand/assets/arabic/kiufqMQsEv/assets/OhxZGHUc2p/a-view-of-the-mosque-2560x1253.jpeg",
      description:
        " المدينة المنورة هي مدينة الرَّسول -صلى الله عليه وسلم- طَيْبةَ الطيِّبةَ مكان نزول الوحي، ومهبط جبريل -عليه السلام- على أفضل المرسلين، وهي نبع الإيمان، وموطن أصحاب الإيمان، ومكان التقاء المهاجرين والأنصار، وهي عاصمة المسلمين الأولى، وفيها فُرِض الجهاد، ومنها شعَّ نور الهداية، وإليها هاجر رسول الرحمة، وفيها عاش آخر حياته - صلى الله عليه وسلم - وبها مات، وفيها دُفن، ومنها يُبعث، وفيها قبره صلوات الله عليه.",
    },
    {
      id: "Al-khobar",
      name: "مدينة الخبر ⚓️",
      image:
        "https://sa.sakan.co/blog/wp-content/uploads/2024/11/%D8%A3%D9%8A%D9%86-%D9%8A%D9%82%D8%B9-%D9%83%D9%88%D8%B1%D9%86%D9%8A%D8%B4-%D8%A7%D9%84%D8%AE%D8%A8%D8%B1%D8%9F.webp",
      description:
        "تتميز مدينة الخبر بشكل عام بالترتيب وقلة ازدحامات المرور ، وتحتوي على العديد من الوجهات الترفيهية مثل الشواطئ والمراكز التجارية ، مما يجعلها واحدة من المدن السعودية الرئيسية المناسبة للعيش والسياحة",
    },
  ];
  return (
    <div className="min-h-screen bg-cover bg-center flex flex-col justify-center items-center text-black px-4 text-center">
      <h1 className="text-3xl md:text-4xl font-bold mb-4 mt-9">
        مرحبا بك في جولة تعريفية على مدن السعودية 👋🏻
      </h1>
      <div className="mt-20 grid grid-cols-2 md:grid-cols-5 gap-4 w-full max-w-6xl ">
        {places.map((place) => (
          <Switch key={place.id} place={place} />
        ))}
      </div>
    </div>
  );
}

export default HeadPage;
